; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v12 ?v6)
             (pred_8 ?v3 ?v13)
             (pred_10 ?v12 ?v13)
             (pred_3 ?v2 ?v12 )
	     (pred_11 ?v12)
             (pred_5 ?v9)
             (pred_9 ?v3)
             (pred_6 ?v13)
             (pred_2 ?v12)
             (pred_1 ?v3)
             (pred_7 ?v12)
             (pred_4 ))



(:action op_5
:parameters (?v5 ?v4 ?v7 ?v1)
:precondition (and (pred_5 ?v5) (pred_5 ?v4) (pred_9 ?v7) (pred_6 ?v1)
          (pred_12 ?v5 ?v4) (pred_8 ?v7 ?v1)
                   (pred_10 ?v4 ?v1) (pred_11 ?v5) 
                   (pred_2 ?v4) (pred_1 ?v7))
:effect (and  (pred_7 ?v4) (not (pred_2 ?v4))))


(:action op_1
:parameters (?v5 ?v10)
:precondition (and (pred_5 ?v5) (pred_5 ?v10)
               (pred_11 ?v5) (pred_12 ?v5 ?v10) (pred_7 ?v10))
:effect (and (pred_11 ?v10) (not (pred_11 ?v5))))

(:action op_3
:parameters (?v5 ?v7)
:precondition (and (pred_5 ?v5) (pred_9 ?v7) 
                  (pred_11 ?v5) (pred_3 ?v7 ?v5) (pred_4 ))
:effect (and (pred_1 ?v7)
   (not (pred_3 ?v7 ?v5)) (not (pred_4 ))))


(:action op_4
:parameters (?v5 ?v11 ?v8)
:precondition (and (pred_5 ?v5) (pred_9 ?v11) (pred_9 ?v8)
                  (pred_11 ?v5) (pred_1 ?v8) (pred_3 ?v11 ?v5))
:effect (and (pred_1 ?v11) (pred_3 ?v8 ?v5)
        (not (pred_1 ?v8)) (not (pred_3 ?v11 ?v5))))

(:action op_2
:parameters (?v5 ?v7)
:precondition (and (pred_5 ?v5) (pred_9 ?v7) 
                  (pred_11 ?v5) (pred_1 ?v7))
:effect (and (pred_4 ) (pred_3 ?v7 ?v5) (not (pred_1 ?v7)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_20 obj_07 obj_25 obj_23 obj_19 obj_09 obj_21 obj_13 obj_15 obj_10 obj_29 obj_12 obj_30 obj_17 obj_04 obj_11 obj_16 obj_27 obj_06 obj_14 obj_18 obj_24 obj_26 obj_03 obj_08
    obj_28 obj_22
    obj_01 obj_02 obj_05
    )

    (:init
       (pred_4)

       (pred_5 obj_20)
       (pred_5 obj_07)
       (pred_5 obj_25)
       (pred_5 obj_23)
       (pred_5 obj_19)
       (pred_5 obj_09)
       (pred_5 obj_21)
       (pred_5 obj_13)
       (pred_5 obj_15)
       (pred_5 obj_10)
       (pred_5 obj_29)
       (pred_5 obj_12)
       (pred_5 obj_30)
       (pred_5 obj_17)
       (pred_5 obj_04)
       (pred_5 obj_11)
       (pred_5 obj_16)
       (pred_5 obj_27)
       (pred_5 obj_06)
       (pred_5 obj_14)
       (pred_5 obj_18)
       (pred_5 obj_24)
       (pred_5 obj_26)
       (pred_5 obj_03)
       (pred_5 obj_08)
       (pred_6 obj_28)
       (pred_6 obj_22)
       (pred_9 obj_01)
       (pred_9 obj_02)
       (pred_9 obj_05)

       (pred_12 obj_20 obj_09)
       (pred_12 obj_20 obj_07)
       (pred_12 obj_07 obj_21)
       (pred_12 obj_07 obj_25)
       (pred_12 obj_07 obj_20)
       (pred_12 obj_25 obj_13)
       (pred_12 obj_25 obj_23)
       (pred_12 obj_25 obj_07)
       (pred_12 obj_23 obj_15)
       (pred_12 obj_23 obj_19)
       (pred_12 obj_23 obj_25)
       (pred_12 obj_19 obj_10)
       (pred_12 obj_19 obj_23)
       (pred_12 obj_09 obj_29)
       (pred_12 obj_09 obj_21)
       (pred_12 obj_09 obj_20)
       (pred_12 obj_21 obj_12)
       (pred_12 obj_21 obj_13)
       (pred_12 obj_21 obj_07)
       (pred_12 obj_21 obj_09)
       (pred_12 obj_13 obj_30)
       (pred_12 obj_13 obj_15)
       (pred_12 obj_13 obj_25)
       (pred_12 obj_13 obj_21)
       (pred_12 obj_15 obj_17)
       (pred_12 obj_15 obj_10)
       (pred_12 obj_15 obj_23)
       (pred_12 obj_15 obj_13)
       (pred_12 obj_10 obj_04)
       (pred_12 obj_10 obj_19)
       (pred_12 obj_10 obj_15)
       (pred_12 obj_29 obj_11)
       (pred_12 obj_29 obj_12)
       (pred_12 obj_29 obj_09)
       (pred_12 obj_12 obj_16)
       (pred_12 obj_12 obj_30)
       (pred_12 obj_12 obj_21)
       (pred_12 obj_12 obj_29)
       (pred_12 obj_30 obj_27)
       (pred_12 obj_30 obj_17)
       (pred_12 obj_30 obj_13)
       (pred_12 obj_30 obj_12)
       (pred_12 obj_17 obj_06)
       (pred_12 obj_17 obj_04)
       (pred_12 obj_17 obj_15)
       (pred_12 obj_17 obj_30)
       (pred_12 obj_04 obj_14)
       (pred_12 obj_04 obj_10)
       (pred_12 obj_04 obj_17)
       (pred_12 obj_11 obj_18)
       (pred_12 obj_11 obj_16)
       (pred_12 obj_11 obj_29)
       (pred_12 obj_16 obj_24)
       (pred_12 obj_16 obj_27)
       (pred_12 obj_16 obj_12)
       (pred_12 obj_16 obj_11)
       (pred_12 obj_27 obj_26)
       (pred_12 obj_27 obj_06)
       (pred_12 obj_27 obj_30)
       (pred_12 obj_27 obj_16)
       (pred_12 obj_06 obj_03)
       (pred_12 obj_06 obj_14)
       (pred_12 obj_06 obj_17)
       (pred_12 obj_06 obj_27)
       (pred_12 obj_14 obj_08)
       (pred_12 obj_14 obj_04)
       (pred_12 obj_14 obj_06)
       (pred_12 obj_18 obj_24)
       (pred_12 obj_18 obj_11)
       (pred_12 obj_24 obj_26)
       (pred_12 obj_24 obj_16)
       (pred_12 obj_24 obj_18)
       (pred_12 obj_26 obj_03)
       (pred_12 obj_26 obj_27)
       (pred_12 obj_26 obj_24)
       (pred_12 obj_03 obj_08)
       (pred_12 obj_03 obj_06)
       (pred_12 obj_03 obj_26)
       (pred_12 obj_08 obj_14)
       (pred_12 obj_08 obj_03)
       (pred_2 obj_10)
       (pred_2 obj_17)
       (pred_2 obj_04)
       (pred_10  obj_10 obj_28)
       (pred_10  obj_17 obj_22)
       (pred_10  obj_04 obj_28)
       (pred_7 obj_20)
       (pred_7 obj_07)
       (pred_7 obj_25)
       (pred_7 obj_23)
       (pred_7 obj_19)
       (pred_7 obj_09)
       (pred_7 obj_21)
       (pred_7 obj_13)
       (pred_7 obj_15)
       (pred_7 obj_29)
       (pred_7 obj_12)
       (pred_7 obj_30)
       (pred_7 obj_11)
       (pred_7 obj_16)
       (pred_7 obj_27)
       (pred_7 obj_06)
       (pred_7 obj_14)
       (pred_7 obj_18)
       (pred_7 obj_24)
       (pred_7 obj_26)
       (pred_7 obj_03)
       (pred_7 obj_08)

       (pred_8  obj_01 obj_28)
       (pred_8  obj_02 obj_22)
       (pred_8  obj_05 obj_28)
       (pred_3 obj_01 obj_23)
       (pred_3 obj_02 obj_03)
       (pred_3 obj_05 obj_20)
       (pred_11 obj_03)
    )

    (:goal (and
       (pred_3 obj_01 obj_12)
    ))
(:constraints
  (always (not (pred_11 obj_25)))
)
)

; plan
1. (op_1 obj_03 obj_06)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_06)
   goals met: 0 of 1
2. (op_1 obj_06 obj_27)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_27)
   goals met: 0 of 1
3. (op_1 obj_27 obj_30)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_30)
   goals met: 0 of 1
4. (op_1 obj_30 obj_13)
   deleted: (pred_11 obj_30)
   added: (pred_11 obj_13)
   goals met: 0 of 1
5. (op_1 obj_13 obj_15)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_15)
   goals met: 0 of 1
6. (op_1 obj_15 obj_23)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_23)
   goals met: 0 of 1
7. (op_3 obj_23 obj_01)
   deleted: (pred_3 obj_01 obj_23) (pred_4)
   added: (pred_1 obj_01)
   goals met: 0 of 1
8. (op_1 obj_23 obj_15)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_15)
   goals met: 0 of 1
9. (op_1 obj_15 obj_13)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_13)
   goals met: 0 of 1
10. (op_1 obj_13 obj_21)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_21)
   goals met: 0 of 1
11. (op_1 obj_21 obj_12)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_12)
   goals met: 0 of 1
12. (op_2 obj_12 obj_01)
   deleted: (pred_1 obj_01)
   added: (pred_4) (pred_3 obj_01 obj_12)
   goals met: 1 of 1
